# -*- mode: org -*-
# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages logdrawer

See [[http://orgmode.org/manual/In_002dbuffer-settings.html][here]] for more startup options.

*** Basic Org stuff
#+BEGIN_SRC emacs-lisp
    ;;;;;;; Org Mode ;;;;;;;
    (require 'org-install)
    (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
    (define-key global-map "\C-cl" 'org-store-link)
    (define-key global-map "\C-ca" 'org-agenda)
    (setq org-log-done t)
    (setq org-tags-column 0)
    (setq org-startup-truncated nil)
    (setq org-agenda-files '("~/Dropbox/org/"))
    (setq org-agenda-window-setup 'current-window)

    (setq org-default-notes-file "~/Dropbox/org/todo.org")
    (setq org-directory "~/Dropbox/org")
    (setq org-startup-indented t)
    (add-hook 'org-mode-hook #'visual-line-mode)


    ;; From [[https://github.com/aaronbieber/dotfiles/blob/master/configs/emacs.d/lisp/init-org.el][here]]
      ;; Logging of state changes
      (setq org-log-done (quote time))
      (setq org-log-redeadline (quote time))
      (setq org-log-reschedule (quote time))
      (setq org-log-into-drawer t)

      (setq org-pretty-entities t)
      (setq org-insert-heading-respect-content t)
      (setq org-ellipsis " …")
      (setq org-export-initial-scope 'subtree)
      (setq org-use-tag-inheritance nil) ;; Use the list form, which happens to be blank
      (setq org-todo-keyword-faces
            '(("OPEN" . org-done)
              ("PAUSED" . org-upcoming-deadline)))

    ;; PDFs visited in Org-mode are opened in Evince (and not in the default choice) http://stackoverflow.com/a/8836108/789593
    (add-hook 'org-mode-hook
          '(lambda ()
             (delete '("\\.pdf\\'" . default) org-file-apps)
             (add-to-list 'org-file-apps '("\\.pdf\\'" . "evince %s"))))

    (defhydra hydra-org (:color red :columns 3)
      "Org Mode Movements"
      ("n" outline-next-visible-heading "next heading")
      ("p" outline-previous-visible-heading "prev heading")
      ("N" org-forward-heading-same-level "next heading at same level")
      ("P" org-backward-heading-same-level "prev heading at same level")
      ("u" outline-up-heading "up heading")
      ("g" org-goto "goto" :exit t))

    ;;(setq org-todo-keywords '((sequence "TODO" "IN-PROGRESS" "WAITING" "|" "DONE" "CANCELED")))
    ;;(setq org-blank-before-new-entry (quote ((heading) (plain-list-item))))
    (setq org-log-done (quote time))
    (setq org-log-redeadline (quote time))
    (setq org-log-reschedule (quote time))
    ;;(setq org-src-window-setup 'current-window)


    (setq org-modules
            '(org-bbdb org-bibtex org-docview org-habit org-info org-w3m))
    (setq org-todo-keywords
            '((sequence "TODO" "IN-PROGRESS" "WAITING" "|" "DONE" "CANCELED")))

    (setq org-todo-keyword-faces
      '(("IMMEDIATE" . (:foreground "#ff0000" :weight bold))
        ("TODO" . (:foreground "#ff39a3" :weight bold))
      ("INPROGRESS" . "#E35DBF")
        ("OPTIONAL" . "#ffa7db")
      ("IN-PROGRESS" . "#00A8E9")
        ("CANCELED" . "#555555")
      ("WAITING" . "pink")
      ("DONE" . "#555555")))

    ;; org-goto/ivy interplay hack
    (setq org-goto-interface 'outline-path-completion)
    (setq org-outline-path-complete-in-steps nil)

  (defun gcal-fetch-and-sync ()
    "Fetch the calendar and then sync"
    (interactive)
    (org-gcal-fetch)
    (org-gcal-sync))

  ;; (add-hook 'org-agenda-mode-hook (lambda () (gcal-fetch-and-sync) ))
  ;; (add-hook 'org-capture-after-finalize-hook (lambda () (gcal-fetch-and-sync) ))
  #+END_SRC

#+RESULTS:
| lambda | nil | (gcal-fetch-and-sync) |

*** Capture
Capture templates. See [[http://cestlaz.github.io/posts/using-emacs-24-capture-2/#.WTtEbXWw5pg][this link]] for info on how to bind a key to bring this up even if emacs isn't in focus. See [[http://orgmode.org/manual/Template-expansion.html#Template-expansion][this link]] for template shortcuts (the % commands below).
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c c")
         'org-capture)

  (setq org-capture-templates
        '(("n" "Note" entry (file+headline "~/Dropbox/org/notes.org" "Notes")
           "* %?\n%T")
          ;; ("a" "Appointment" entry (file  "~/Dropbox/org/gcal.org" )
          ;;  "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
          ("c" "Timecard" entry (file+datetree "~/Dropbox/org/timecard.org")
           "* %?" :tree-type "week")
          ("m" "Meeting Notes" entry (file "~/Dropbox/org/meetings.org")
           "* %t %?\n" :prepend t)
          ("g" "Goals" entry (file "~/Dropbox/org/goals.org")
           "* %?\n" :prepend t)
          ("k" "To Learn" entry (file+headline "~/Dropbox/org/learning.org" "To Learn")
          "* %?\n%T" :prepend t)
          ("o" "Learned Topic Notes" entry (file+headline "~/Dropbox/org/learning.org" "Topics")
          "* %?\n%T" :prepend t)
          ("p" "Papers to read" entry (file+headline "~/Dropbox/org/paper_notes.org" "To Read")
          "* %?\n** Authors: \n** Abstract: " :prepend t)
           ;; Links
           ("l" "Links")
          ("le" "Emacs Link" entry (file+headline "~/Dropbox/org/saved_links.org" "Emacs Links")
           "* %^L %^g \n%?\n%T" :prepend t)
          ("ld" "Deep Learning Link" entry (file+headline "~/Dropbox/org/saved_links.org" "Deep Learning Links")
           "* %^L %^g \n%?\n%T" :prepend t)
          ("lm" "Management Link" entry (file+headline "~/Dropbox/org/saved_links.org" "Management Links")
           "* %^L %^g \n%?\n%T" :prepend t)
          ("lp" "Programming Link" entry (file+headline "~/Dropbox/org/saved_links.org" "Programming Links")
           "* %^L %^g \n%?\n%T" :prepend t)
          ("lr" "Random Link" entry (file+headline "~/Dropbox/org/saved_links.org" "Random Links")
           "* %^L %^g \n%?\n%T" :prepend t)
           ;; Argo stuff
           ("a" "Argo")
           ("am", "Meeting Notes" entry (file+datetree "~/Dropbox/org/argo.org")
           "* %?\nEntered on %U\n")
           ;; Tasks
           ("t" "Tasks")
          ("th" "High Priority Task" checkitem (file+headline "~/Dropbox/org/today.org" "High Priority")
           "** %?" :prepend t)
          ("tp" "Personal Task" entry (file+headline "~/Dropbox/org/todo.org" "To Do Items")
           "* %?\n%T" :prepend t)
          ;; ("tm" "Mesh Task" entry (file+headline "~/Dropbox/org/mesh.org" "Mesh To Do Items")
          ;;  "* %?\n%T" :prepend t)
          ;; ("te" "ECR Task" entry (file+headline "~/Dropbox/org/ecr.org" "To Do Items")
          ;;  "* %?\n%T" :prepend t)
          ("i" "Ideas" entry (file+headline "~/Dropbox/org/ideas.org" "Ideas")
           "* %?\n%T" :prepend t)
          ("e" "Emacs Notes" entry (file "~/Dropbox/org/emacs.org")
           "* %?" :prepend t)
          ("j" "Journal" entry (file+datetree "~/Dropbox/org/journal.org")
           "* %?\nEntered on %U\n")))
#+END_SRC

#+RESULTS:
| n | Note | entry | (file+headline ~/Dropbox/org/notes.org Notes) | * %? |

** C++ IDE stuff
- Most taken from [[https://onze.io/emacs/c++/2017/03/16/emacs-cpp.html][here]]
- Some recommendations on using ycmd with ros [[https://www.reddit.com/r/vim/comments/4835a7/youcompleteme_c_out_of_the_box/d0hthzr/][here]]
- More on ycmd setup [[https://www.reddit.com/r/emacs/comments/7wzstc/emacs_as_a_c_ide_martin_sosics_blog/][here]]
- [[https://www.gnu.org/software/emacs/manual/html_node/efaq/Customizing-C-and-C_002b_002b-indentation.html][Good link]] on changing indendation styles for C/C++
#+BEGIN_SRC emacs-lisp
      ;; Snippets
      (use-package yasnippet
        :ensure t
        :diminish yas-minor-mode
        :init (yas-global-mode t))

      ;; Autocomplete
      (use-package company
        :defer 1
        :diminish company-mode
        ;; :bind (:map company-active-map
        ;;             ("M-j" . company-select-next)
        ;;             ("M-k" . company-select-previous))
        :preface
        ;; enable yasnippet everywhere
        (defvar company-mode/enable-yas t
          "Enable yasnippet for all backends.")
        (defun company-mode/backend-with-yas (backend)
          (if (or 
               (not company-mode/enable-yas) 
               (and (listp backend) (member 'company-yasnippet backend)))
              backend
            (append (if (consp backend) backend (list backend))
                    '(:with company-yasnippet))))

        :init (global-company-mode t)
        :config
        ;; no delay no autocomplete
        (setq
         company-idle-delay 0.1
         company-minimum-prefix-length 2
         company-tooltip-align-annotations 't
         company-tooltip-limit 20)

        (setq company-backends 
                       (mapcar #'company-mode/backend-with-yas company-backends)))

  (setq company-global-modes '(not org-mode, not markdown-mode))

  ;; better selection box for company - requires 26.1
  ;; (use-package company-box
  ;;   :hook (company-mode . company-box-mode))



    ;; Code-comprehension server
    ;; (use-package ycmd
    ;;   :ensure t
    ;;   :init (add-hook 'c++-mode-hook #'ycmd-mode)
    ;;   :config
    ;;   (set-variable 'ycmd-server-command '("python" "/home/gfoil/projects/ycmd/ycmd/"))

    ;;   ;; Default ycmd config file:
    ;;   (set-variable 'ycmd-global-config (expand-file-name "/home/gfoil/dotfiles/emacs/ycm_conf.py"))

    ;;   ;; Use this if you want project-specific ycmd configs.
    ;;   ;; Set in ~/Dropbox/personal/emacs_secrets.el
    ;;   ;; (set-variable 'ycmd-extra-conf-whitelist '("~/Repos/*"))

    ;;   (use-package company-ycmd
    ;;     :ensure t
    ;;     :init (company-ycmd-setup)
    ;;     :config (add-to-list 'company-backends (company-mode/backend-with-yas 'company-ycmd))))

    ;; (use-package flycheck-ycmd
    ;;   :commands (flycheck-ycmd-setup)
    ;;   :init (add-hook 'ycmd-mode-hook 'flycheck-ycmd-setup))

    ;; ;; Show argument list in echo area
    ;; (use-package eldoc
    ;;   :diminish eldoc-mode
    ;;   :init (add-hook 'ycmd-mode-hook 'ycmd-eldoc-setup))
#+END_SRC

#+RESULTS:
: 5

